<?php

//Создайте переменную $a и присвойте ей значение 3. Выведите значение этой переменной на экран.
$a = 3;
echo $a;

echo '<hr>';

//Создайте переменные $a=10 и $b=2. Выведите на экран их сумму, разность, произведение и частное (результат деления).
$a = 10;
$b = 2;
echo $a + $b.'<br>';
echo $a - $b.'<br>';
echo $a * $b.'<br>';
echo $a / $b.'<br>';

echo '<hr>';

/*Создайте переменные $c=15 и $d=2. Просуммируйте их, а результат присвойте переменной $result. Выведите на экран значение переменной $result.*/
$c=15;
$d=2;
$result = $c + $d;
echo $result;

echo '<hr>';

//Создайте переменные $a=10, $b=2 и $c=5. Выведите на экран их сумму.
$a=10;
$b=2;
$c=5;
echo $a + $b +$c;

echo '<hr>';

/*Создайте переменные $a=17 и $b=10. Отнимите от $a переменную $b и результат присвойте переменной $c. Затем создайте переменную $d, присвойте ей значение 7. Сложите переменные $c и $d, а результат запишите в переменную $result. Выведите на экран значение переменной $result. */
$a=17;
$b=10;
$c = $a - $b;
$d = 7;
$result = $c + $d;
echo $result;

echo '<hr>';

/*Создайте переменную $text и присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной на экран. */
$text = 'Привет, Мир!';
echo $text;

echo '<br>';

/*Создайте переменные $text1='Привет, ' и $text2='Мир!'. С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'. . */
$text = 'Привет,';
$text2 = ' Мир!';
echo $text.$text2.'<br>';

/*Создайте переменную $name и присвойте ей ваше имя. Выведите на экран фразу 'Привет, %Имя%!'. Вместо %Имя% должно стоять ваше имя. */
$name = ' Игорь';
echo $text.$name.'!<br>';

/*Создайте переменную $age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'. */
$age = 36;
echo 'Мне '.$age.' лет!';

echo '<hr>';

/*Создайте переменную $text и присвойте ей значение 'abcde'. Обращаясь к отдельным символам этой строки выведите на экран символ 'a', символ 'c', символ 'e'. */
$text = 'abcde';
echo $text[0];
echo $text[2];
echo $text[4].'<br>';

/*Дана произвольная строка, например, 'abcde'. Поменяйте первую букву (то есть букву 'a') этой строки на '!'. */
$text = 'abcde';
$text[0] = '!';
echo $text;

echo '<hr>';

/*Создайте переменную $num и присвойте ей значение '12345'. Найдите сумму цифр этого числа. */
$num = '12345';
echo $num[0] + $num[1] + $num[2] + $num[3] + $num[4];

echo '<hr>';

/*Напишите скрипт, который считает количество секунд в часе, в сутках, в месяце. */
echo 60 * 60 . ' секунд в часе <br>';
echo 60 * 60 * 24 . ' секунд в сутках <br>';
echo 60 * 60 * 24 * 30 . ' секунд в месяц (взависимости от кол-ва дней в месяце)';

echo '<hr>';

/*Создайте три переменные - час, минута, секунда. С их помощью выведите текущее время в формате 'час:минута:секунда'. */
$hour = date("H");
$minut = date("i");
$sec = date("s");
echo $hour . ':' . $minut . ':' . $sec;

echo '<hr>';

/*Создайте переменную, присвойте ей число. Возведите это число в квадрат (это значит нужно умножить его само на себя). Выведите его на экран. */
$a = 5;
echo $a * $a;

echo '<hr>';

/*Переделайте этот код так, чтобы в нем использовались операции +=, -=, *=, /=. Количество строк кода при этом не должно измениться. */
$var = 47;
$var += 7;
$var -= 18;
$var *= 10;
$var /= 20;
echo $var;

echo '<hr>';

/*Переделайте этот код так, чтобы в нем использовалась операция .=. Количество строк кода при этом не должно измениться. */
$text = 'Я';
$text .= ' хочу';
$text .= ' знать';
$text .= ' PHP!';
echo $text;

echo '<hr>';

/*Переделайте этот код так, чтобы в нем использовались операции ++ и --. Количество строк кода при этом не должно измениться. */
$var = 10;
$var++;
$var++;
$var--;
echo $var;

echo '<hr>';

/*Переделайте этот код так, чтобы в нем использовались операции ++, -- , +=, -=, *=, /=. Количество строк кода при этом не должно измениться. */

$var = 10;
$var += 7;
$var++;
$var--;
$var += 12;
$var *= 7;
$var -= 15;
echo $var;