<?php

//Создайте массив $arr=['a', 'b', 'c']. Выведите значение массива на экран с помощью функции var_dump().
$arr=['a', 'b', 'c'];
var_dump($arr);

echo "<hr>";

/*С помощью массива $arr из предыдущего номера выведите на экран содержимое первого, второго и третьего элементов. */
echo $arr[0].$arr[1].$arr[2];

echo "<hr>";

/*Создайте массив $arr=['a', 'b', 'c', 'd'] и с его помощью выведите на экран строку 'a+b, c+d'. */
$arr=['a', 'b', 'c', 'd'];
echo $arr[0] . '+' . $arr[1];
echo '<br>';
echo $arr[2] . '+' . $arr[3];

echo "<hr>";

/*Создайте массив $arr с элементами 2, 5, 3, 9. Умножьте первый элемент массива на второй, а третий элемент на четвертый. Результаты сложите, присвойте переменной $result. Выведите на экран значение этой переменной. */
$arr = [2, 5, 3, 9];
$result = ($arr[0] * $arr[1]) + ($arr[2] * $arr[3]);
echo $result;

echo "<hr>";

/*Заполните массив $arr числами от 1 до 5. Не объявляйте массив, а просто заполните его присваиванием $arr[] = новое значение. */
$arr[] = 1;
$arr[] = 2;
$arr[] = 3;
$arr[] = 4;
$arr[] = 5;

echo "<hr>";

/* Создайте массив $arr. Выведите на экран элемент с ключом 'c'. */
$arr = ['a'=>1, 'b'=>2, 'c'=>3];
echo $arr['c'];

echo "<hr>";

/*Создайте массив $arr. Найдите сумму элементов этого массива. */
$arr = ['a'=>1, 'b'=>2, 'c'=>3];
echo $arr['a'] + $arr['b'] + $arr['c'];

echo "<hr>";

//Создайте массив заработных плат $arr. Выведите на экран зарплату Пети и Коли.
$arr = ['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
echo 'Зарплата Пети - ' . $arr['Петя'] . '<br>';
echo 'Зарплата Коли - ' . $arr['Коля'];

echo "<hr>";

/*Создайте ассоциативный массив дней недели. Ключами в нем должны служить номера дней от начала недели (понедельник - должен иметь ключ 1, вторник - 2 и т.д.). Выведите на экран текущий день недели.*/

$arr = [1=>'пн', 2=>'вт', 3=>'ср', 4=>'чт', 5=>'пт', 6=>'сб', 7=>'вс'];
echo $arr[6];
echo '<br>';

/*Пусть теперь номер дня недели хранится в переменной $day, например там лежит число 3. Выведите день недели, соответствующий значению переменной $day.*/
$day = 6;
echo $arr[$day];

echo "<hr>";

/*Создайте многомерный массив $arr. С его помощью выведите на экран слова 'joomla', 'drupal', 'зеленый', 'красный'. */
$arr = [
    'cms'=>['joomla', 'wordpress', 'drupal'],
    'colors'=>['blue'=>'голубой', 'red'=>'красный', 'green'=>'зеленый']
];
echo $arr['cms'][0] . ', ' . $arr['cms'][2] . ', ' . $arr['colors']['green']. ', ' . $arr['colors']['red'];

echo "<hr>";

/*Создайте двухмерный массив. Первые два ключа - это 'ru' и 'en'. Пусть первый ключ содержит элемент, являющийся массивом названий дней недели по-русски, а второй - по-английски. Выведите с помощью этого массива понедельник по-русски и среду по английски (пусть понедельник - это первый день). */
$arr = [
    'ru'=>[1=>'Понедельник', 2=>'Вторник', 3=>'Среда', 4=>'Четверг', 5=>'Пятница', 6=>'Суббота', 7=>'Воскресенье'],
    'en'=>[1=>'Monday', 2=>'Tuesday', 3=>'Wednesday', 4=>'Thursday', 5=>'Friday', 6=>'Saturday', 7=>'Sunday'],
];
echo $arr['ru'][1].'<br />';
echo $arr['en'][3].'<br />';

/*Пусть теперь в переменной $lang хранится язык (она принимает одно из значений или 'ru', или 'en' - либо то, либо то), а в переменной $day - номер дня. Выведите словом день недели, соответствующий переменным $lang и $day. То есть: если, к примеру, $lang = 'ru' и $day = 3 - то выведем 'среда'. */
$lang = 'ru';
$day = 6;
echo $arr[$lang][$day];
